// src/features/AboutPage.tsx

import React from 'react';
import  styles from './AboutPage.module.css'

const AboutPage = () => {
  return (
    <div className={styles.centerContainer}>
      <div className={styles.contentWrapper}>
      <h1>אודות האתר</h1>
      <p>
        ברוכים הבאים לאתר שלנו, המקום המושלם ללמוד ולתרגל צרפתית בדרך חווייתית ואינטראקטיבית. אתר זה מיועד לכל מי שרוצה לשפר את ידיעתו בצרפתית, בין אם אתה מתחיל מאפס או כבר עם ידע בסיסי.
      </p>
      <h2>שיעורים</h2>
      <p>
        תחת הקטגוריה "שיעורים", תוכלו למצוא שיעורים אינטראקטיביים המאפשרים ללמוד מילים בצרפתית ולהאזין אליהן. המשתמש צריך רק ללחוץ על האייקון כדי להאזין להגיית המילה.
      </p>
      <h2>תרגול</h2>
      <p>
        תחת הקטגוריה "תרגול", המשתמש יכול לתרגל את ידעו ואת ההגייה שלו בצרפתית. בהתאם לתגובת המשתמש, תוצג תגובה "נכון" או "לא נכון". המשתמש צריך ללחוץ על סמל ההקלטה כדי להקליט את עצמו.
      </p>
      <p>
        האתר משתמש במיקרופון וברמקולים כדי לאפשר חוויה אינטראקטיבית ומעשירה.
      </p>
      <h2>רישום והתקדמות</h2>
      <p>
        משתמשים יכולים להירשם לאתר כדי לשמור את התקדמותם בלימודים. שיעורים ותרגולים יתעדכנו על ידי מנהל האתר, כך שתמיד יהיו לכם תכנים חדשים ללמידה ולשיפור.
      </p>
      <p>
        אנו מזמינים אתכם להצטרף אלינו למסע מרתק בעולם השפה הצרפתית. תנו לנו להיות המדריכים שלכם בדרך לשליטה בשפה המרתקת והחשובה הזו.
      </p>
    </div>
    </div>
  );
};

export default AboutPage;
